app/controllers/authentication_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
	def verifyToken
	 	token = JsonWebToken.decode(params[:token])
	 	if token
	 	 	begin
	 	 	  @user = User.find(token[:user_id])

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
	def signup
		user = User.new(sign_up_param)

		if user.save