app/controllers/todos_controller.rb

  def index
    todos = Todo.order("created_at DESC")
---
SELECT "todos".* FROM "todos" ORDER BY created_at DESC

  def create
    todo = Todo.create(todo_param)
---
INSERT INTO "todos" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "fvncncvnbbnvnbv"], ["created_at", "2021-01-23 11:22:46.119209"], ["updated_at", "2021-01-23 11:22:46.119209"]]

  def update
    todo = Todo.find(params[:id])
    todo.update_attributes(todo_param)
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
UPDATE "todos" SET "done" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["done", true], ["updated_at", "2021-01-23 07:39:17.081139"], ["id", 23]]

  def destroy
    todo = Todo.find(params[:id])
    todo.destroy
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 23]]